In [57]:
import pandas as pd

In [58]:
import numpy as np

In [59]:
#基本功能

In [60]:
#reindex方法用于创建一个符合新索引的新对象

In [61]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [62]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])     #Series调用reindex方法时，会将数据按照新的索引进行排序

In [64]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [66]:
obj3        #对于顺序数据，在重建索引时可能会需要进行插值或填值，method可选参数允许我们在重建索引时插值。

0      blue
2    purple
4    yellow
dtype: object

In [67]:
obj3.reindex(range(6), method = 'ffill')    #ffill方法会将值向前填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [68]:
#在DataFrame中，reindex可以改变行索引，列索引，也可以同时改变。当仅传入一个序列时，结果中的行会重建索引。

In [69]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [70]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [71]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [72]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [73]:
states = ['Texas', 'Utah', 'California']

In [74]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [75]:
frame.loc[['a', 'b', 'c', 'd'], states]

G:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [76]:
#轴向上删除条目

In [77]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [78]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [79]:
new_obj = obj.drop('c')     #drop方法会返回一个含有指示值或轴向上删除值的新对象。

In [80]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [81]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [82]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [83]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
data.drop(['Colorado', 'Ohio'])      #使用标签序列会根据行标签删除值(轴0)

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data.drop('two', axis=1)           #传递axis=1或axis='columns'来从列中删除值

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [86]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [87]:
obj.drop('c', inplace=True)         #inplace清除被删除的数据

In [88]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [89]:
#索引，选择，过滤

In [151]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])          #Series的索引值可以不仅仅是整数

In [152]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [153]:
obj['b']

1.0

In [154]:
obj[1]

1.0

In [155]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [95]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [96]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [97]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [98]:
obj['b':'c']     #这种方式切片包含尾部

b    1.0
c    2.0
dtype: float64

In [99]:
obj['b':'c'] = 5

In [100]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [101]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [104]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [105]:
data[:2]      #选择行

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [106]:
data[data['three'] > 5] #使用布尔值进行索引

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [144]:
data[data < 5] = 0

In [145]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
#使用loc和iloc选择数据

In [111]:
data.loc['Colorado', ['two', 'three']]    #通过标签选择

two      5
three    6
Name: Colorado, dtype: int32

In [112]:
data.iloc[2, [3, 0, 1]]           #通过整数标签

four    11
one      8
two      9
Name: Utah, dtype: int32

In [113]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [114]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [115]:
data.loc[:'Utah', 'two']    #索引功能可以用于切片

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [140]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [129]:
#整数索引

In [130]:
ser = pd.Series(np.arange(3.))

In [131]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [132]:
ser[-1]      #包含有整数索引(0, 1, 2)，无法推断用户需要的索引方式(标签索引，位置索引)

KeyError: -1

In [138]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [139]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [143]:
ser2[-1]

2.0

In [146]:
ser[:1]                              #精确处理，可以使用loc(用于标签)或iloc(用于整数)

0    0.0
dtype: float64

In [147]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [156]:
ser.iloc[:1]

0    0.0
dtype: float64